apache/nuttx/arch/arm/src/tms570/chip/tms570_pcr.h
#define PCR_PSPWERDWN2_PS16_SHIFT       (0)       /* Bits 0-3: Quadrants for PS16 */
#define PCR_PSPWERDWN2_PS16_MASK        (15 << PCR_PSPWERDWN2_PS16_SHIFT)
#  define PCR_PSPWERDWN2_PS16_Q1        (1 << PCR_PSPWERDWN2_PS16_SHIFT)
#  define PCR_PSPWERDWN2_PS16_Q2        (2 << PCR_PSPWERDWN2_PS16_SHIFT)
#  define PCR_PSPWERDWN2_PS16_Q3        (4 << PCR_PSPWERDWN2_PS16_SHIFT)
#  define PCR_PSPWERDWN2_PS16_Q4        (8 << PCR_PSPWERDWN2_PS16_SHIFT)
#  define PCR_PSPWERDWN2_PS16_QALL      (15 << PCR_PSPWERDWN2_PS16_SHIFT)
#define PCR_PSPWERDWN2_PS17_SHIFT       (4)       /* Bits 4-7: Quadrants for PS17 */
#define PCR_PSPWERDWN2_PS17_MASK        (15 << PCR_PSPWERDWN2_PS17_SHIFT)
#  define PCR_PSPWERDWN2_PS17_Q1        (1 << PCR_PSPWERDWN2_PS17_SHIFT)
#  define PCR_PSPWERDWN2_PS17_Q2        (2 << PCR_PSPWERDWN2_PS17_SHIFT)
#  define PCR_PSPWERDWN2_PS17_Q3        (4 << PCR_PSPWERDWN2_PS17_SHIFT)
#  define PCR_PSPWERDWN2_PS17_Q4        (8 << PCR_PSPWERDWN2_PS17_SHIFT)
#  define PCR_PSPWERDWN2_PS17_QALL      (15 << PCR_PSPWERDWN2_PS17_SHIFT)
#define PCR_PSPWERDWN2_PS18_SHIFT       (8)       /* Bits 8-11: Quadrants for PS18 */
#define PCR_PSPWERDWN2_PS18_MASK        (15 << PCR_PSPWERDWN2_PS18_SHIFT)
#  define PCR_PSPWERDWN2_PS18_Q1        (1 << PCR_PSPWERDWN2_PS18_SHIFT)
#  define PCR_PSPWERDWN2_PS18_Q2        (2 << PCR_PSPWERDWN2_PS18_SHIFT)
#  define PCR_PSPWERDWN2_PS18_Q3        (4 << PCR_PSPWERDWN2_PS18_SHIFT)
#  define PCR_PSPWERDWN2_PS18_Q4        (8 << PCR_PSPWERDWN2_PS18_SHIFT)
#  define PCR_PSPWERDWN2_PS18_QALL      (15 << PCR_PSPWERDWN2_PS18_SHIFT)
#define PCR_PSPWERDWN2_PS19_SHIFT       (12)      /* Bits 12-15: Quadrants for PS19 */
#define PCR_PSPWERDWN2_PS19_MASK        (15 << PCR_PSPWERDWN2_PS19_SHIFT)
#  define PCR_PSPWERDWN2_PS19_Q1        (1 << PCR_PSPWERDWN2_PS19_SHIFT)
#  define PCR_PSPWERDWN2_PS19_Q2        (2 << PCR_PSPWERDWN2_PS19_SHIFT)
#  define PCR_PSPWERDWN2_PS19_Q3        (4 << PCR_PSPWERDWN2_PS19_SHIFT)
#  define PCR_PSPWERDWN2_PS19_Q4        (8 << PCR_PSPWERDWN2_PS19_SHIFT)
#  define PCR_PSPWERDWN2_PS19_QALL      (15 << PCR_PSPWERDWN2_PS19_SHIFT)
#define PCR_PSPWERDWN2_PS20_SHIFT       (16)      /* Bits 16-19: Quadrants for PS20 */
#define PCR_PSPWERDWN2_PS20_MASK        (15 << PCR_PSPWERDWN2_PS20_SHIFT)
#  define PCR_PSPWERDWN2_PS20_Q1        (1 << PCR_PSPWERDWN2_PS20_SHIFT)
#  define PCR_PSPWERDWN2_PS20_Q2        (2 << PCR_PSPWERDWN2_PS20_SHIFT)
#  define PCR_PSPWERDWN2_PS20_Q3        (4 << PCR_PSPWERDWN2_PS20_SHIFT)
#  define PCR_PSPWERDWN2_PS20_Q4        (8 << PCR_PSPWERDWN2_PS20_SHIFT)
#  define PCR_PSPWERDWN2_PS20_QALL      (15 << PCR_PSPWERDWN2_PS20_SHIFT)
#define PCR_PSPWERDWN2_PS21_SHIFT       (20)      /* Bits 20-23: Quadrants for PS21 */
#define PCR_PSPWERDWN2_PS21_MASK        (15 << PCR_PSPWERDWN2_PS21_SHIFT)
#  define PCR_PSPWERDWN2_PS21_Q1        (1 << PCR_PSPWERDWN2_PS21_SHIFT)
#  define PCR_PSPWERDWN2_PS21_Q2        (2 << PCR_PSPWERDWN2_PS21_SHIFT)
#  define PCR_PSPWERDWN2_PS21_Q3        (4 << PCR_PSPWERDWN2_PS21_SHIFT)
#  define PCR_PSPWERDWN2_PS21_Q4        (8 << PCR_PSPWERDWN2_PS21_SHIFT)
#  define PCR_PSPWERDWN2_PS21_QALL      (15 << PCR_PSPWERDWN2_PS21_SHIFT)
#define PCR_PSPWERDWN2_PS22_SHIFT       (24)      /* Bits 24-27: Quadrants for PS22 */
#define PCR_PSPWERDWN2_PS22_MASK        (15 << PCR_PSPWERDWN2_PS22_SHIFT)
#  define PCR_PSPWERDWN2_PS22_Q1        (1 << PCR_PSPWERDWN2_PS22_SHIFT)
#  define PCR_PSPWERDWN2_PS22_Q2        (2 << PCR_PSPWERDWN2_PS22_SHIFT)
#  define PCR_PSPWERDWN2_PS22_Q3        (4 << PCR_PSPWERDWN2_PS22_SHIFT)
#  define PCR_PSPWERDWN2_PS22_Q4        (8 << PCR_PSPWERDWN2_PS22_SHIFT)
#  define PCR_PSPWERDWN2_PS22_QALL      (15 << PCR_PSPWERDWN2_PS22_SHIFT)
#define PCR_PSPWERDWN2_PS23_SHIFT       (28)      /* Bits 28-31: Quadrants for PS23 */
#define PCR_PSPWERDWN2_PS23_MASK        (15 << PCR_PSPWERDWN2_PS23_SHIFT)
#  define PCR_PSPWERDWN2_PS23_Q1        (1 << PCR_PSPWERDWN2_PS23_SHIFT)
#  define PCR_PSPWERDWN2_PS23_Q2        (2 << PCR_PSPWERDWN2_PS23_SHIFT)
#  define PCR_PSPWERDWN2_PS23_Q3        (4 << PCR_PSPWERDWN2_PS23_SHIFT)
#  define PCR_PSPWERDWN2_PS23_Q4        (8 << PCR_PSPWERDWN2_PS23_SHIFT)
#  define PCR_PSPWERDWN2_PS23_QALL      (15 << PCR_PSPWERDWN2_PS23_SHIFT)

/* Peripheral Power-Down Set Register 3 and Peripheral Power-Down Clear Register 3 */

#define PCR_PSPWERDWN3_PS24_SHIFT       (0)       /* Bits 0-3: Quadrants for PS24 */
#define PCR_PSPWERDWN3_PS24_MASK        (15 << PCR_PSPWERDWN3_PS24_SHIFT)
#  define PCR_PSPWERDWN3_PS24_Q1        (1 << PCR_PSPWERDWN3_PS24_SHIFT)
#  define PCR_PSPWERDWN3_PS24_Q2        (2 << PCR_PSPWERDWN3_PS24_SHIFT)
#  define PCR_PSPWERDWN3_PS24_Q3        (4 << PCR_PSPWERDWN3_PS24_SHIFT)
#  define PCR_PSPWERDWN3_PS24_Q4        (8 << PCR_PSPWERDWN3_PS24_SHIFT)
#  define PCR_PSPWERDWN3_PS24_QALL      (15 << PCR_PSPWERDWN3_PS24_SHIFT)
#define PCR_PSPWERDWN3_PS25_SHIFT       (4)       /* Bits 4-7: Quadrants for PS25 */
#define PCR_PSPWERDWN3_PS25_MASK        (15 << PCR_PSPWERDWN3_PS25_SHIFT)
#  define PCR_PSPWERDWN3_PS25_Q1        (1 << PCR_PSPWERDWN3_PS25_SHIFT)
#  define PCR_PSPWERDWN3_PS25_Q2        (2 << PCR_PSPWERDWN3_PS25_SHIFT)
#  define PCR_PSPWERDWN3_PS25_Q3        (4 << PCR_PSPWERDWN3_PS25_SHIFT)
#  define PCR_PSPWERDWN3_PS25_Q4        (8 << PCR_PSPWERDWN3_PS25_SHIFT)
#  define PCR_PSPWERDWN3_PS25_QALL      (15 << PCR_PSPWERDWN3_PS25_SHIFT)
#define PCR_PSPWERDWN3_PS26_SHIFT       (8)       /* Bits 8-11: Quadrants for PS26 */
#define PCR_PSPWERDWN3_PS26_MASK        (15 << PCR_PSPWERDWN3_PS26_SHIFT)
#  define PCR_PSPWERDWN3_PS26_Q1        (1 << PCR_PSPWERDWN3_PS26_SHIFT)
#  define PCR_PSPWERDWN3_PS26_Q2        (2 << PCR_PSPWERDWN3_PS26_SHIFT)
#  define PCR_PSPWERDWN3_PS26_Q3        (4 << PCR_PSPWERDWN3_PS26_SHIFT)
#  define PCR_PSPWERDWN3_PS26_Q4        (8 << PCR_PSPWERDWN3_PS26_SHIFT)
#  define PCR_PSPWERDWN3_PS26_QALL      (15 << PCR_PSPWERDWN3_PS26_SHIFT)
#define PCR_PSPWERDWN3_PS27_SHIFT       (12)      /* Bits 12-15: Quadrants for PS27 */
#define PCR_PSPWERDWN3_PS27_MASK        (15 << PCR_PSPWERDWN3_PS27_SHIFT)
#  define PCR_PSPWERDWN3_PS27_Q1        (1 << PCR_PSPWERDWN3_PS27_SHIFT)
#  define PCR_PSPWERDWN3_PS27_Q2        (2 << PCR_PSPWERDWN3_PS27_SHIFT)
#  define PCR_PSPWERDWN3_PS27_Q3        (4 << PCR_PSPWERDWN3_PS27_SHIFT)
#  define PCR_PSPWERDWN3_PS27_Q4        (8 << PCR_PSPWERDWN3_PS27_SHIFT)
#  define PCR_PSPWERDWN3_PS27_QALL      (15 << PCR_PSPWERDWN3_PS27_SHIFT)
#define PCR_PSPWERDWN3_PS28_SHIFT       (16)      /* Bits 16-19: Quadrants for PS28 */
#define PCR_PSPWERDWN3_PS28_MASK        (15 << PCR_PSPWERDWN3_PS28_SHIFT)
#  define PCR_PSPWERDWN3_PS28_Q1        (1 << PCR_PSPWERDWN3_PS28_SHIFT)
#  define PCR_PSPWERDWN3_PS28_Q2        (2 << PCR_PSPWERDWN3_PS28_SHIFT)
#  define PCR_PSPWERDWN3_PS28_Q3        (4 << PCR_PSPWERDWN3_PS28_SHIFT)
#  define PCR_PSPWERDWN3_PS28_Q4        (8 << PCR_PSPWERDWN3_PS28_SHIFT)
#  define PCR_PSPWERDWN3_PS28_QALL      (15 << PCR_PSPWERDWN3_PS28_SHIFT)
#define PCR_PSPWERDWN3_PS29_SHIFT       (20)      /* Bits 20-23: Quadrants for PS29 */
#define PCR_PSPWERDWN3_PS29_MASK        (15 << PCR_PSPWERDWN3_PS29_SHIFT)
#  define PCR_PSPWERDWN3_PS29_Q1        (1 << PCR_PSPWERDWN3_PS29_SHIFT)
#  define PCR_PSPWERDWN3_PS29_Q2        (2 << PCR_PSPWERDWN3_PS29_SHIFT)
#  define PCR_PSPWERDWN3_PS29_Q3        (4 << PCR_PSPWERDWN3_PS29_SHIFT)
#  define PCR_PSPWERDWN3_PS29_Q4        (8 << PCR_PSPWERDWN3_PS29_SHIFT)
#  define PCR_PSPWERDWN3_PS29_QALL      (15 << PCR_PSPWERDWN3_PS29_SHIFT)
#define PCR_PSPWERDWN3_PS30_SHIFT       (24)      /* Bits 24-27: Quadrants for PS30 */
#define PCR_PSPWERDWN3_PS30_MASK        (15 << PCR_PSPWERDWN3_PS30_SHIFT)
#  define PCR_PSPWERDWN3_PS30_Q1        (1 << PCR_PSPWERDWN3_PS30_SHIFT)
#  define PCR_PSPWERDWN3_PS30_Q2        (2 << PCR_PSPWERDWN3_PS30_SHIFT)
#  define PCR_PSPWERDWN3_PS30_Q3        (4 << PCR_PSPWERDWN3_PS30_SHIFT)
#  define PCR_PSPWERDWN3_PS30_Q4        (8 << PCR_PSPWERDWN3_PS30_SHIFT)
#  define PCR_PSPWERDWN3_PS30_QALL      (15 << PCR_PSPWERDWN3_PS30_SHIFT)
#define PCR_PSPWERDWN3_PS31_SHIFT       (28)      /* Bits 28-31: Quadrants for PS31 */
#define PCR_PSPWERDWN3_PS31_MASK        (15 << PCR_PSPWERDWN3_PS31_SHIFT)
#  define PCR_PSPWERDWN3_PS31_Q1        (1 << PCR_PSPWERDWN3_PS31_SHIFT)
#  define PCR_PSPWERDWN3_PS31_Q2        (2 << PCR_PSPWERDWN3_PS31_SHIFT)
#  define PCR_PSPWERDWN3_PS31_Q3        (4 << PCR_PSPWERDWN3_PS31_SHIFT)
#  define PCR_PSPWERDWN3_PS31_Q4        (8 << PCR_PSPWERDWN3_PS31_SHIFT)
#  define PCR_PSPWERDWN3_PS31_QALL      (15 << PCR_PSPWERDWN3_PS31_SHIFT)

#endif /* __ARCH_ARM_SRC_TMS570_CHIP_TMS570_PCR_H */
